Autodesk.Revit.DB.NavisworksParameters
Since:
2014
An enumerated type listing possible "Parameter conversions" of Navisworks Exporter.
Since:
2014

Autodesk.Revit.DB.NavisworksParameters.All
The file exporter converts parameters for all found elements, including the referenced elements.
As a result, extra property tabs are available in Autodesk Navisworks.

Autodesk.Revit.DB.NavisworksParameters.Elements
The file exporter converts parameters for all found elements.

Autodesk.Revit.DB.NavisworksParameters.None
The file exporter does not convert parameters.